#include <stdio.h>

int main() {
  int n = 6;

  // Если условие истинно, то выполняется действие1
  // Истинным считается любое ненулевое значение
  // Ложным считается нулевое значение

  // if (условие) {
  //   действие1;
  // }
  
  if (n == 5) {
    printf("true\n");
  }

  // Если условие истинно, то выполняется действие1

  // if (условие) {
  //   действие1;
  // } else {
  //   действие2;
  // }

  if (n == 5) {
    printf("n равно 5\n");
  } else {
    printf("n не равно 5\n");
  }

  // Комбинирование условий else-if
  if (n == 0) {
    printf("0\n");
  } else if (n > 0) {
    printf("1");
  } else if (n > 10) {
    printf("2");
  } else if (n > 20) {
    printf("3");
  } else {
    printf("4");
  }
  
  // Операторы сравнения
  printf("%d == 5: %d\n", n, n == 5);
  printf("%d != 5: %d\n", n, n != 5);
  printf(" %d > 5: %d\n", n, n > 5);
  printf(" %d < 5: %d\n", n, n < 5);
  printf("%d >= 5: %d\n", n, n >= 5);
  printf("%d <= 5: %d\n", n, n <= 5);

  return 0;
}